{"id":265,"date":"2017-01-15T08:45:53","date_gmt":"2017-01-15T08:45:53","guid":{"rendered":"http:\/\/www.sciloo.com\/?p=265"},"modified":"2018-05-29T00:11:52","modified_gmt":"2018-05-28T18:41:52","slug":"book-review-zero-to-one-by-peter-thiel-next-google","status":"publish","type":"post","link":"http:\/\/localhost:8180\/2017\/01\/15\/book-review-zero-to-one-by-peter-thiel-next-google\/","title":{"rendered":"Book review &#8211; Zero to One by Peter Thiel. Next google?"},"content":{"rendered":"<p>Wondering, what it takes to be the next google or the next big thing. I have few secrets to share with you so sit tight and read this post. How many of you knew Peter Thiel before reading this post? It&#8217;s fine if you don&#8217;t know, we don&#8217;t know many things in the world. I will tell you who is Peter and what advice he has for budding startups and new age entrepreneurs.<\/p>\n<h4>PayPal Mafia<\/h4>\n<p>Peter is part of PayPal mafia. Yes mafia, because the people in this group started their own successful multi-billion dollar startups like Uber, SpaceX, Linked, youtube, etc. Check them below, specially Thiel and Elon Musk. I will write about Elon Musk in due time. He along with Elon Musk sold their company PayPal to eBay for ~1.5 billion dollars.<\/p>\n<p><img loading=\"lazy\" class=\"alignleft wp-image-270\" src=\"http:\/\/www.localhost:8180\/wp-content\/uploads\/2017\/01\/schermafbeelding-2016-03-15-om-20-09-26.png\" alt=\"paypal mafia\" width=\"500\" height=\"432\" \/>Peter also runs a startup program (Thiel fellowship) 20 under 20 [1] for startups with innovative ideas. This is good enough to increase your appetite for what is inside the book, let&#8217;s march ahead.<\/p>\n<h4>Book Review<\/h4>\n<p>In this book, Peter shares his experiences, experiments, and progress of industry from 2000s bubble (how it bloated and blasted) till recent times. His most important advice come to the importance of innovation for the startups or any business. Without innovation or new ideas, businesses are locked in competition and survival which doesn&#8217;t bring quick and positive change to the world. These businesses worry about their daily margin and put their maximum efforts on their earnings.<\/p>\n<h4>Monopoly and Innovation<\/h4>\n<p>Rather than relying solely on competition, companies should focus on new ideas to create monopoly just like google did. Google has captured the market even though it denies this argument and presents itself as a company in fierce competition. Google states that it has ~3% market share of ads business and less than 1% of the technology market. This argument helps it avoid strict scrutiny of competition laws. You will not believe, it captures more than 70% of the search engine market.<\/p>\n<p>Being a monopoly is not bad otherwise, google would not have become what it is today &#8211; innovating in every corner of open problems and technologies, be it AI, consumer market (phones, chrome devices, android), and cloud, etc.<\/p>\n<h4>Monopoly versus Competition<\/h4>\n<p>Monopoly gives you time to focus on the things that businesses tangled in competition can&#8217;t achieve. These things can be employee benefits like free food, free dental cover, gym, flexible work, etc. These can also be working on new projects like driverless cars, project moon, etc. Thiel points out that competitive businesses tend to squeeze every efficiency out of everything. He mentions it is the reason you see grandma or grandpa working at the reception of many restaurants.<\/p>\n<p>Monopoly drives new progress, see when Microsoft came in the market, it pushed IBM from the OS market and when Apple came it pushed Microsoft dominance down. Similarly, when Google came, it pushed Yahoo and Microsoft from their dominant stage of the tech and search business.<\/p>\n<h4>Conclusion<\/h4>\n<p>This book gives powerful insights on how new startups should think and drive their strategy in doing something that is 10x better or totally new idea. From my experiences, it is by far one of the best books on startups.<\/p>\n<p>Innovation is the key to enjoying the fruits and using those fruits to further drive innovation with wide social impact and change.<\/p>\n<p>[1] <a href=\"http:\/\/thielfellowship.org\/\">http:\/\/thielfellowship.org\/<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Wondering, what it takes to be the next google or the next big thing. I have few secrets to share with you so sit tight and read this post. How many of you knew Peter Thiel before reading this post? It&#8217;s fine if you don&#8217;t know, we don&#8217;t know many things in the world. I&hellip; <a class=\"more-link\" href=\"http:\/\/localhost:8180\/2017\/01\/15\/book-review-zero-to-one-by-peter-thiel-next-google\/\">Continue reading <span class=\"screen-reader-text\">Book review &#8211; Zero to One by Peter Thiel. Next google?<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2,4,132,131],"tags":[142,137,136],"_links":{"self":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/265"}],"collection":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/comments?post=265"}],"version-history":[{"count":16,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/265\/revisions"}],"predecessor-version":[{"id":483,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/265\/revisions\/483"}],"wp:attachment":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/media?parent=265"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/categories?post=265"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/tags?post=265"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}