{"id":382,"date":"2017-02-03T01:49:38","date_gmt":"2017-02-02T20:19:38","guid":{"rendered":"http:\/\/www.sciloo.com\/?p=382"},"modified":"2017-03-23T21:41:24","modified_gmt":"2017-03-23T16:11:24","slug":"wifiradio-crossespenetratespass-wall-light-failsdoesnt","status":"publish","type":"post","link":"http:\/\/localhost:8180\/2017\/02\/03\/wifiradio-crossespenetratespass-wall-light-failsdoesnt\/","title":{"rendered":"How WiFi\/Radio crosses\/penetrates\/pass through the wall where light fails\/doesn&#8217;t?"},"content":{"rendered":"<p>We had been thinking on the topic from a long time. How can you use WiFi even sitting in a closed room, bathroom, balcony with closed doors magically? How it is that possible that light (bulb\/source put in place of WiFi router) not entering those areas. See the embedded video for a wonderful tour of the quest to answer. These both radiations are part of the electromagnetic spectrum but still behave differently. Is it increasing your curiosity level, let&#8217;s dive in&#8230; TV, mobile, WiFi all use transmitted radio waves and convert them to mechanical vibrations in the speaker to create sound waves that can be heard.<\/p>\n<p><iframe loading=\"lazy\" title=\"How WiFi\/Radio crosses\/penetrates\/pass through the wall where light fails?\" width=\"750\" height=\"422\" src=\"https:\/\/www.youtube.com\/embed\/QPbRlNvEtbo?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe><\/p>\n<p>The first step is understanding the radio waves, these are used for long distance communication.Radio waves have the longest wavelength[1] in the electromagnetic spectrum. Check the wonderful resource provided in [1] at the end. We will cover more details about what do we mean by wavelength in the context of visible light and how we can make sense of it, can we feel\/realise it somehow? Stay tuned and subscribe to the news from this site. A quick experiment was conducted with our laser. A double slit was built with two tapes and a hair in between and laser showed behaviour like wave by showing bright and dark areas interleaved, check the photos below.<\/p>\n<p>We conducted a quick experiment with our laser. We built a double slit with two black tapes and a human hair in between (to partition the single slit into two) and laser showed behaviour like wave by showing bright and dark areas interleaved, check the photos below.<\/p>\n<p><img loading=\"lazy\" class=\"wp-image-386 alignnone\" src=\"http:\/\/www.localhost:8180\/wp-content\/uploads\/2017\/02\/laser_double_slit-300x270.png\" alt=\"\" width=\"203\" height=\"183\" \/> <img loading=\"lazy\" class=\"wp-image-387 alignnone\" src=\"http:\/\/www.localhost:8180\/wp-content\/uploads\/2017\/02\/laser_double_slit_2-300x284.png\" alt=\"\" width=\"193\" height=\"183\" \/><img loading=\"lazy\" class=\"wp-image-385 alignnone\" src=\"http:\/\/www.localhost:8180\/wp-content\/uploads\/2017\/02\/IMG_20170202_230658_HDR-169x300.jpg\" alt=\"\" width=\"103\" height=\"183\" \/><\/p>\n<p><strong>Electromagnetic spectrum<\/strong><\/p>\n<p>Now, the electromagnetic spectrum is the range of all types of Electromagnetic radiations which are the stream of massless particles called photons, each travelling in a wave-like a pattern at speed of light.<\/p>\n<p>Photons are really difficult and at the same time easy to understand. Easy in the sense that they are the smallest light particles that behave like wave and particle both. Difficult in the sense to visualise them [2] &#8211; can we see\/feel an individual photon or are they made of electrons or very small particles. See the picture from [2] for quick reference and read the article &#8211; picture shows the energy exchange areas between light and electrons (size on the scale<\/p>\n<p>See the picture (taken from electron microscope) below taken from [2] for quick reference &#8211; picture shows the energy exchange areas between light and electrons (size on the scale of micrometres). Brighter yellow are the areas where electron got photon and demonstrated the change opposite to the darker area (red).<\/p>\n<p><img loading=\"lazy\" class=\"wp-image-383 alignnone\" src=\"http:\/\/www.localhost:8180\/wp-content\/uploads\/2017\/02\/1-thefirstever-300x300.jpg\" alt=\"\" width=\"210\" height=\"210\" \/><\/p>\n<p><strong>Interactions &#8211; Light and Material Properties<\/strong><br \/>\nDifferent materials can have one of three effects on electromagnetic waves at different frequencies. They can absorb the waves, they can alter the direction of the waves, or they can allow the waves to pass through without any change.<\/p>\n<p>The radio and light waves, both are part of the electromagnetic spectrum but are very different to each other. Radio waves (scales of meters\/kilometres) are much bigger than light waves (scales of nanometers\/picometers).<\/p>\n<p><strong>How Light cross some materials<\/strong><br \/>\nTo understand how visible light can pass through some materials, we can think of the atoms in that material containing electrons with different energy levels.<\/p>\n<p>If the wall is made out of glass, Light, and radio wave will go through it. If the wall is made of wood or concrete only radio wave can pass through. But if the wall is made out of iron, neither the radio waves nor light will not go through the wall, Wow, it sounds complicated, just hold on for few sec! There is a concept of Faraday cage [3] also on the same principles or iron blocking the radio waves.<\/p>\n<p><strong>Structure of the material &#8211; energy levels + effects<\/strong><br \/>\nSo, the main thing is the structure of the wall.It is important, what the wall is made from, what kinds of atoms and molecules are its constituents. It is also very important how these atoms in the wall are tight together.<\/p>\n<p>When the energy level of a certain electron in the atom is the same as the energy level of the light going through it, the light is absorbed and its energy is converted into heat.<\/p>\n<p><strong>Examples &#8211; Different types of materials and light<\/strong><br \/>\nWood has electrons that are arranged in such a way that their energy is the same as the energy of visible light. For this reason, wood absorbs visible light.<\/p>\n<p>Clear glass does not have as many electrons with energy levels that absorb visible light. However, it does absorb frequencies slightly higher than visible light (ultraviolet) and slightly below visible light (infrared). If you add certain materials to the glass you can change the energy levels of the electrons in the glass.<\/p>\n<p>For example, adding copper will cause the glass to absorb light in the red end of the visible spectrum so that the light passing through will tend to look blue.<\/p>\n<p>Adding chromium to the glass will cause it to absorb both red and blue energies of light. When you look through the glass, objects will appear green since the green light is passing through.<\/p>\n<p><strong>Conclusion<\/strong><br \/>\nThe atomic structure, especially the properties of the electron shells of atoms in the wall are quite interesting. It can point out if that particular wall\/material will be transparent or not for different types of electromagnetic wave. Follow the reference given in the end too.<\/p>\n<p><strong>References<\/strong><\/p>\n<p>[1] Wavelength of light: http:\/\/science-edu.larc.nasa.gov\/EDDOCS\/Wavelengths_for_Colors.html<\/p>\n<p>[2] EPFL news about light duality: http:\/\/actu.epfl.ch\/news\/the-first-ever-photograph-of-light-as-both-a-parti\/<\/p>\n<p>[3] Faraday cage explained by Prof. Walter Lewin, MIT: http:\/\/www.youtube.com\/watch?v=QSqlfybnwts&amp;t=282s<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We had been thinking on the topic from a long time. How can you use WiFi even sitting in a closed room, bathroom, balcony with closed doors magically? How it is that possible that light (bulb\/source put in place of WiFi router) not entering those areas. See the embedded video for a wonderful tour of&hellip; <a class=\"more-link\" href=\"http:\/\/localhost:8180\/2017\/02\/03\/wifiradio-crossespenetratespass-wall-light-failsdoesnt\/\">Continue reading <span class=\"screen-reader-text\">How WiFi\/Radio crosses\/penetrates\/pass through the wall where light fails\/doesn&#8217;t?<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[4],"tags":[172,165,211,170,166,162,171,163,174,168],"_links":{"self":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/382"}],"collection":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/comments?post=382"}],"version-history":[{"count":11,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/382\/revisions"}],"predecessor-version":[{"id":469,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/382\/revisions\/469"}],"wp:attachment":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/media?parent=382"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/categories?post=382"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/tags?post=382"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}