{"id":456,"date":"2017-03-19T23:51:39","date_gmt":"2017-03-19T18:21:39","guid":{"rendered":"https:\/\/www.sciloo.com\/?p=456"},"modified":"2017-03-24T00:24:32","modified_gmt":"2017-03-23T18:54:32","slug":"focus-important-aspect-life","status":"publish","type":"post","link":"http:\/\/localhost:8180\/2017\/03\/19\/focus-important-aspect-life\/","title":{"rendered":"Focus &#8211; the most important aspect of Life"},"content":{"rendered":"<p><strong>Your perception &#8211; successful people around you<\/strong><\/p>\n<p>We all observe life around us and can&#8217;t stop us from thinking that how less capable or less hardworking people are ahead of you in terms of success and money or any other aspect of life. They can be your colleagues, boss or your neighbour, you interact with them almost daily and think that you are more talented than all them of them but still behind them in accomplishments (salary, promotions, house, etc.).<\/p>\n<p><strong>The left out factor<\/strong><\/p>\n<p>You are right and wrong at the same time. It is right in the sense that you are more capable but you are wrong thinking them less capable. You should be thinking how this can be the case of right wrong duality. There is a big difference that you have missed during your comparison or bias. The main factor that you miss everytime is Focus. If you go to the dictionary,  Focus is <em><strong>&#8220;the centre of interest or activity&#8221; or &#8220;adapt to the prevailing level of light and become able to see clearly&#8221;.<\/strong><\/em><\/p>\n<p><img loading=\"lazy\" class=\"alignleft size-medium wp-image-461\" src=\"http:\/\/www.localhost:8180\/wp-content\/uploads\/2017\/03\/BLFocus-300x300.jpg\" alt=\"\" width=\"300\" height=\"300\" \/><\/p>\n<p><strong>Reasoning &#8211; Why Focus is the most important factor<\/strong><\/p>\n<p>Let&#8217;s understand why Focus is the single most important factor. It gives you clarity on what you want &#8211; you may want to go to a place for vacations or you may want to do a particular kind of job. Suppose you are confused in multiple choices and can&#8217;t focus on a place for vacations then how you will plan for it and when you will go there. Without the clear focus, you will not have any target and no timeline. Due to this, slowly you start loosing your interest and never achieve what you wanted.<\/p>\n<p>What may be missing from your side can be the focus on your job or your life where as other people have put all their energy in a focused path and hence they seem to me more successful than you. They get more results as their efforts are more in a single direction whereas your efforts are distributed across multiple directions. The focus is not just visual or mental focus it also brings your energy into a focused set of actions that are aligned in a consistent direction. This focus not only is required for personal success but for <a href=\"http:\/\/www.entrepreneur.com\/article\/248563\">business succes<\/a>s [1] also.<\/p>\n<p><strong>How to improve it<\/strong><\/p>\n<p>Now the question comes, how you can improve our focus. It is simple &#8211; it depends on of what you want in life. You have to decide as less as possible directions maximum 1 or 2 because our mind gets confused and loose interest beyond this. Then you should stop comparing two different lifestyles &#8211; focussed and varied. You should keep asking this question to the successful people about their mantra for success. Grow your observation on facts rather than biases.<\/p>\n<p>It doesn&#8217;t mean that if you like many things then you are wrong, it is also good in one way where you are getting satisfaction out of it and you are happily living. Then you should stop comparing two different lifestyles &#8211; focussed and distributed. Also, the Focus becomes more important in today&#8217;s internet rich world where you are continuously disturbed by notifications, SMS, calls, and emails, etc. You have to decide <a href=\"http:\/\/www.psychologytoday.com\/blog\/your-brain-work\/200910\/easily-distracted-why-its-hard-focus-and-what-do-about-it\">what you want to see (focus)<\/a> [2] not what the software (throwing you all kind of data) is throwing on you. This breaks your continuous attention on a subject\/job\/reading and you start wasting your time on internet\/facebook\/google searching unnecessary and unwanted things.<\/p>\n<p>Stay focused start growing&#8230;<\/p>\n<p><strong>References<\/strong><\/p>\n<p>[1] Importance of focus in business success &#8211; http:\/\/www.entrepreneur.com\/article\/248563<\/p>\n<p>[2] Stopping distractions &#8211; http:\/\/www.psychologytoday.com\/blog\/your-brain-work\/200910\/easily-distracted-why-its-hard-focus-and-what-do-about-it<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Your perception &#8211; successful people around you We all observe life around us and can&#8217;t stop us from thinking that how less capable or less hardworking people are ahead of you in terms of success and money or any other aspect of life. They can be your colleagues, boss or your neighbour, you interact with&hellip; <a class=\"more-link\" href=\"http:\/\/localhost:8180\/2017\/03\/19\/focus-important-aspect-life\/\">Continue reading <span class=\"screen-reader-text\">Focus &#8211; the most important aspect of Life<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"image","meta":[],"categories":[194,193,192],"tags":[212,19,199,49,200,62,201,101],"_links":{"self":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/456"}],"collection":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/comments?post=456"}],"version-history":[{"count":3,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/456\/revisions"}],"predecessor-version":[{"id":464,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/456\/revisions\/464"}],"wp:attachment":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/media?parent=456"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/categories?post=456"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/tags?post=456"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}