{"id":643,"date":"2017-05-11T10:36:14","date_gmt":"2017-05-11T05:06:14","guid":{"rendered":"https:\/\/www.sciloo.com\/?p=643"},"modified":"2017-05-12T01:55:26","modified_gmt":"2017-05-11T20:25:26","slug":"learn-approaches-part2-learning-learn-active-learning","status":"publish","type":"post","link":"http:\/\/localhost:8180\/2017\/05\/11\/learn-approaches-part2-learning-learn-active-learning\/","title":{"rendered":"How we learn (approaches) Part2-Learning to learn (active learning)"},"content":{"rendered":"<h5>Forceful learning<\/h5>\n<p>kids know better how they learn rather than somebody teaching\/telling them how to learn. Teachers should create an environment for allowing kids to discuss how they learn better and talk openly. But this is not the case in most of the institutions as most of the focus is on forcefully broadcasting textbooks via mouth and not creating a conducive and collaborative environment. The possible reasons can be, it takes more time and energy and it can impact revenue per kid or they have never thought of it.<\/p>\n<p>This clearly shows one signal that particular school or institution either doing it intentionally or unintentionally. If it is intentional then future of kids are in risky hands and if it is unintentional then again the future of kids are in risky hands as the people in charge don&#8217;t do research about learning and don&#8217;t learn themselves.<\/p>\n<p>Kids are very delicate, a proper environment should be provided to them to nurture with freedom as well as discipline. They should feel free to talk openly and not scared of the teachers. I have seen kids including at my home, they are so afraid of teacher and think that they will only do work as given by the teacher and not other work as we are not teachers.<\/p>\n<p>There is a general principle of active learning (<a href=\"http:\/\/weatherhead.case.edu\/executive-education\/instructors\/david-kolb\">David Kolb<\/a>) given below.<\/p>\n<pre><strong>(do -&gt; review -&gt; learn -&gt; apply )<\/strong>\r\n\r\n<strong>+ with many reflection cycles (for understanding how did you tackle the task and what learning you can take to do it better next time)<\/strong><\/pre>\n<p>There are few misconceptions about what makes a better learner, let&#8217;s discuss them in the section below.<\/p>\n<h5>The misconceptions about better learner<\/h5>\n<p>It is very hard to formulate that study harder makes a better learner. We don&#8217;t fully understand peoples&#8217; different backgrounds, family culture as well as their social networking and these all things also affect the learning goals and reach. Take the example of Einstein who was kicked out of school and failed many exams but this didn&#8217;t affect his learning and output.<\/p>\n<p>So we can say that a good learner is a person who&#8217;s always open to learning, networking, taking risks. We need to read research about learning to understand better what is going on the field and what are the latest findings on learning. This will help us in imbibing those learning in our learning approach and it may add value to the existing methodologies that we are following.<\/p>\n<h5>Approach<\/h5>\n<p>We need to learn on our own and then discuss the learning in a group, it can be in person or on a social platform like online forums, Whatsapp, Facebook, etc. Learning is impactful if it is done in groups that are collaborating and interacting with each other frequently. Along with learning, collaboration builds social skills which in-turn make learning more enjoyable and strong with top notch output.<\/p>\n<p>Please share your thoughts in the comment section or by reaching to us<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Forceful learning kids know better how they learn rather than somebody teaching\/telling them how to learn. Teachers should create an environment for allowing kids to discuss how they learn better and talk openly. But this is not the case in most of the institutions as most of the focus is on forcefully broadcasting textbooks via&hellip; <a class=\"more-link\" href=\"http:\/\/localhost:8180\/2017\/05\/11\/learn-approaches-part2-learning-learn-active-learning\/\">Continue reading <span class=\"screen-reader-text\">How we learn (approaches) Part2-Learning to learn (active learning)<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2,193,192,232],"tags":[19,233,57,62,89],"_links":{"self":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/643"}],"collection":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/comments?post=643"}],"version-history":[{"count":12,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/643\/revisions"}],"predecessor-version":[{"id":658,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/643\/revisions\/658"}],"wp:attachment":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/media?parent=643"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/categories?post=643"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/tags?post=643"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}