{"id":665,"date":"2017-05-17T09:37:13","date_gmt":"2017-05-17T04:07:13","guid":{"rendered":"https:\/\/www.sciloo.com\/?p=665"},"modified":"2017-05-17T10:07:15","modified_gmt":"2017-05-17T04:37:15","slug":"innovation-linearslow-exponentialfast","status":"publish","type":"post","link":"http:\/\/localhost:8180\/2017\/05\/17\/innovation-linearslow-exponentialfast\/","title":{"rendered":"Innovation &#8211; linear\/slow or exponential\/fast"},"content":{"rendered":"<p>We need to elaborate the problems we are solving more clearly so that their solutions becomes transparent. We should not only be focusing on the technical part but also on validating the ideas and its reach. Henry Ford mass produced internal combustion engine and cars which were available only for few rich people earlier, he created a new market with significant social impacts.<\/p>\n<p>You should identify the main stakeholders for your innovative idea or product. You must analyse and evaluate the resources, the process of these companies, as innovation often appears on the border of markets dominated by important actors. You could be partners or disruptions as the case may be. At this point, I demonstrated why I think that theories and practices you can do are not only topical but also in a rich industrial and academical past.<\/p>\n<p>Innovation isn&#8217;t a single big shot but rather a process of finding possibilities, contextualising them in domain\/market, developing them for markets, and deploying them while thinking about concepts, markets or business model. So, it is not linear or sequential but the mix of parallel items &#8211; working on the ideas, evaluating in the market, building relationship at the same time. The innovation process is not just developing the idea or innovative design but applying them as the application on markets. To convert your idea into an opportunity, we need to execute both innovative concepts and applications on markets in time.<\/p>\n<p>We should thrive to create our immediate environment and market rather than anticipate the evolution of the world, just like Telsa\/Elon Musk did and PayPal did.<\/p>\n<p>We should find the answers to the following questions as early as possible.<\/p>\n<p>1. What are the relevant markets to test and deploy an innovation?<\/p>\n<p>2. What is your team for this challenging voyage?<\/p>\n<h5>Target long term, plan midterm, execute short term<\/h5>\n<p>Plan speed and value indicators of the idea\/product because, as you innovate, you target a long-term ambition while living in a short-term and planning in a medium term. You must plan for the time needed for the first demonstration of the innovation, the first marketing, applying to the other markets and taking it around the world.<\/p>\n<h5>Value<\/h5>\n<p>Along the innovation process, the value for the users and ourselves should be our top most priority. Value is often created with an innovative concept because it is innovation and can result in direct sales. Innovation can also increase the value of other products, add value to brands. We must balance and choose between low and high-value parts of the product\/offering, this is the everyday story for all the innovators.<\/p>\n<p>Innovation is is much more than a simple opportunity identification and involve the following key points.<\/p>\n<h5>Type of innovation<\/h5>\n<p>What is new in technology, architecture, and business model?<\/p>\n<h5>Performance<\/h5>\n<p>What are the factors to evaluate the innovation value that are characteristics of our idea\/product?<\/p>\n<h5>Process<\/h5>\n<p>Who works on what for the innovation and how to build a strong relationship among people of your startup and its stakeholders (inside and outside both) &#8211; users, investors, industry research, academic research, etc.<\/p>\n<p>A company used to spend huge money on advertisements, promotion and events but with the evolution of social media platforms like Linkedin, Facebook, Twitter, etc., this can be done by the users, so prepare a strategy to utilise these medias.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We need to elaborate the problems we are solving more clearly so that their solutions becomes transparent. We should not only be focusing on the technical part but also on validating the ideas and its reach. Henry Ford mass produced internal combustion engine and cars which were available only for few rich people earlier, he created&hellip; <a class=\"more-link\" href=\"http:\/\/localhost:8180\/2017\/05\/17\/innovation-linearslow-exponentialfast\/\">Continue reading <span class=\"screen-reader-text\">Innovation &#8211; linear\/slow or exponential\/fast<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[194,132,131],"tags":[237,135,236],"_links":{"self":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/665"}],"collection":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/comments?post=665"}],"version-history":[{"count":7,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/665\/revisions"}],"predecessor-version":[{"id":694,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/665\/revisions\/694"}],"wp:attachment":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/media?parent=665"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/categories?post=665"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/tags?post=665"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}