{"id":667,"date":"2017-05-17T20:07:43","date_gmt":"2017-05-17T14:37:43","guid":{"rendered":"https:\/\/www.sciloo.com\/?p=667"},"modified":"2017-05-17T23:15:19","modified_gmt":"2017-05-17T17:45:19","slug":"choosing-startup-team","status":"publish","type":"post","link":"http:\/\/localhost:8180\/2017\/05\/17\/choosing-startup-team\/","title":{"rendered":"Choosing your startup team"},"content":{"rendered":"<p>In startup and in entrepreneur journey, people often go faster alone and they believe it too, but they go much further when they work together in a team. Even if you are very talented, your skills might not be enough for the project.<\/p>\n<h5>Complementary skills and psychological aspects<\/h5>\n<p>Complementing is a key skill and need in entrepreneurship. Be aware of your capabilities and skills to improve them more. Also be aware where you lag the skills and need other people assistance to pull the plug. Not only technical and functional skills are necessary but also the Social skills, qualities of each member will create a unique cocktail for the project or startup.<\/p>\n<p>We will need innovation and agility capacities, an open mind, networking mindset, creativity and courage to take tough and decisive actions. Make fewer mistakes but it happens sometimes.<\/p>\n<p>Select members who have these advantages given below.<\/p>\n<h6>1. They love doing by iteration<\/h6>\n<h6>2. Who will go beyond than already made solutions, crossing the set bar<\/h6>\n<h6>3. With proven track record in the past<\/h6>\n<p>Also, partners&#8217; personal goals and perspective matter and points are discussed below. These need to be discussed among the team and an understanding should be achieved so that people remain aligned and know each other motivation and purpose.<\/p>\n<h5>Perspective &#8211; money<\/h5>\n<p>How long can one survive with the money you have after investing in your startup? Keeping age, status, the way of life in mind and thinking in mind when deciding a partner. For some people money is aim but others it can only be an indicator of success. Both perspectives are fine if everybody is aware of these and agreement is reached among founders or partners.<\/p>\n<h5>Background and awareness<\/h5>\n<p>Check your partner&#8217;s support system &#8211; his background, networking, culture, education, journey to reach the current stage, honesty, etc.? Think about your venture or project in short term and long term while choosing your partner. Keep in mind that you can&#8217;t find all the qualities in a single person, you need to be aware of what you want to compromise on.<\/p>\n<h5>Perspective- success<\/h5>\n<p>How do you and your partner(s) define success?<\/p>\n<p>1. Short term profit<\/p>\n<p>2. Creating a brand that will live for years &#8211; like Google, Tesla, etc.<\/p>\n<p>3. Size growth &#8211; want to be small or big<\/p>\n<p>Make a list of your key indicators to success for the next years all partners may have different angles to success. For the venture to succeed you need to bring shared vision and goals.<\/p>\n<p>If you don&#8217;t have success and performance evaluation criteria then tasting the success is a tough chore. The challenges and direction that you want to plan and do together will bring directions to the team along with enthusiasm and motivation. This brings a meaning to short term plans and actions.<\/p>\n<p>We often spend too much time learning how to work rather than facing and executing tough jobs together. Working on the challenges is the best way to know and test each other. Prepare for the worst so that you are ready and safeguard yourself before the real trouble starts where lots of people life and future is at stake. It is not telling you to be negative but it will help you plan alternative plans.  Fear of things is the best way to find solutions to them. Everybody fear but who control it they succeed.<\/p>\n<h5>Conflict management<\/h5>\n<p>Chaotic environment and start can get us more edge in performance as well as decision making as it forces you to doubt on your working style and to modify what can possibly go wrong. You will find missing learnings and checks with these challenges your success. The more we fix the things by thinking of the possible failures and by discussing things, the less impact the company face. Teams grow more in the adversity than in success. If the crisis is insurmountable, you will need to decide who is more likely to preserve the stakeholders. Remember that the one who has power in a relationship is the one who is ready to give up something. This person will need courage to change what can be changed and wisdom to accept what will never change.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In startup and in entrepreneur journey, people often go faster alone and they believe it too, but they go much further when they work together in a team. Even if you are very talented, your skills might not be enough for the project. Complementary skills and psychological aspects Complementing is a key skill and need&hellip; <a class=\"more-link\" href=\"http:\/\/localhost:8180\/2017\/05\/17\/choosing-startup-team\/\">Continue reading <span class=\"screen-reader-text\">Choosing your startup team<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[194,232,132],"tags":[238,135,101,236],"_links":{"self":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/667"}],"collection":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/comments?post=667"}],"version-history":[{"count":9,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/667\/revisions"}],"predecessor-version":[{"id":703,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/667\/revisions\/703"}],"wp:attachment":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/media?parent=667"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/categories?post=667"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/tags?post=667"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}