{"id":670,"date":"2017-05-17T01:55:12","date_gmt":"2017-05-16T20:25:12","guid":{"rendered":"https:\/\/www.sciloo.com\/?p=670"},"modified":"2017-05-17T10:07:33","modified_gmt":"2017-05-17T04:37:33","slug":"starting-a-technical-startup","status":"publish","type":"post","link":"http:\/\/localhost:8180\/2017\/05\/17\/starting-a-technical-startup\/","title":{"rendered":"Starting a technical startup &#8211; evaluating the idea\/opportunity"},"content":{"rendered":"<p>We will see what kind of problems\/misconceptions you can face in a tech startup. People get often confused between industry and market. There is a laser industry.However, there is no laser market. There is a welding market, a cutting market etc where lasers are used.<\/p>\n<p>Let&#8217;s discuss other important factors such as Market, Consumers and Offerings.<\/p>\n<h5>Market<\/h5>\n<p>As per economics, a market is a place where the price keeps supply and demand in check and balance. A market is a place where a certain amount of uses, functions, even desires exist which can be satisfied by the offerings. For example, the desire for clean hair is related to the hygienic but the desire to look beautiful which probably requires shampoo is not straightforward and easy to relate A shampoo which only accomplishes the first idea (to clean hair) doesn&#8217;t have a great value and is not expensive and can be prepared by a simple chemical formulation. A shampoo that can make you beautiful is not simple to make and can create a monopoly over the market.<\/p>\n<h5>Users<\/h5>\n<p>Who can afford the desire to look beautiful? Here comes the question of the use, the desire, and the user segmentation. We start from our invention, industry and then we transform it into use and desire. We then try to see the segmentation of the user group and have to think who can replace you (your product&#8217;s substitutions) or give you a competition.<\/p>\n<p>A substitute may not do the same as your product but it can replace it. Let&#8217;s understand with an example, the first substitute to a shampoo is not a shampoo but the action of not doing anything &#8211; don&#8217;t wash my hair. `<\/p>\n<p>Value is felt by the user so look at the value from the user point of view and don&#8217;t assume it yourself that the user will find the top value in your offerings.<\/p>\n<p>If you are a startup company with an unparallel invention, such as a software, understanding the value is not a problem, it is your existence in coming years which the clients worry about that you will be gone out of business and their work will be held in the middle. Clients will prefer a low profile tech company which is less efficient but more long lasting. Look at the possible risks for your users and try to convince them.<\/p>\n<h5>Offerings<\/h5>\n<p>Products and offerings can be offered in either of the following dimensions.<\/p>\n<h6>1. Position for innovation<\/h6>\n<h6>2. Position for imitation<\/h6>\n<h6>3. Position for adaptation<\/h6>\n<h6>4. Reposition yourself again<\/h6>\n<p>You need not follow a single direction out of the above list but it can change with time. Position your business with the utmost car, make it either low-end or high-end, don&#8217;t get confused with multiple directions. Get an advantage in one of the following dimensions but the pioneering spirit is a must to become the market leader and big success otherwise you will have to satisfy yourself being a follower.<\/p>\n<h6>Technical edge<\/h6>\n<p>Technological edge is not just a patent, it is also having experience and execution expertise. Without technical advantage, it is very difficult to become a pioneer in the market or industry.<\/p>\n<h6>Scarce asset<\/h6>\n<p>Physical assets, for example, if I have ~80% of the world&#8217;s phosphate sites, I am the leader in phosphate whatever happens.<\/p>\n<h6>User behaviour &#8211; love for the brand<\/h6>\n<p>Bring a differentiation to the users, it can be geographical or it can be in perception. You have to convince the users through perception may be in performance, look and feel, or savings etc.<\/p>\n<p>And finally, to look credible, you need three rules given below.<\/p>\n<p>Be comprehensible, it must be clear and significant for the buyer &#8211; either fewer risks or more value, or the right time.<\/p>\n<p>It must have the possibility to gain value from the company on its value market, so check how the user value your product and company.<\/p>\n<p>Safe from competition &#8211; it must defend against competition so that it brings something difficult to imitate and can create monopoly just like google and tesla.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We will see what kind of problems\/misconceptions you can face in a tech startup. People get often confused between industry and market. There is a laser industry.However, there is no laser market. There is a welding market, a cutting market etc where lasers are used. Let&#8217;s discuss other important factors such as Market, Consumers and Offerings.&hellip; <a class=\"more-link\" href=\"http:\/\/localhost:8180\/2017\/05\/17\/starting-a-technical-startup\/\">Continue reading <span class=\"screen-reader-text\">Starting a technical startup &#8211; evaluating the idea\/opportunity<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[194,132,131],"tags":[234,235,135],"_links":{"self":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/670"}],"collection":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/comments?post=670"}],"version-history":[{"count":13,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/670\/revisions"}],"predecessor-version":[{"id":685,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/670\/revisions\/685"}],"wp:attachment":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/media?parent=670"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/categories?post=670"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/tags?post=670"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}