{"id":704,"date":"2017-07-03T13:12:20","date_gmt":"2017-07-03T07:42:20","guid":{"rendered":"https:\/\/www.sciloo.com\/?p=704"},"modified":"2017-07-03T13:12:20","modified_gmt":"2017-07-03T07:42:20","slug":"know-and-spread-intelligence","status":"publish","type":"post","link":"http:\/\/localhost:8180\/2017\/07\/03\/know-and-spread-intelligence\/","title":{"rendered":"Know and spread intelligence"},"content":{"rendered":"<h4>Intelligence &#8211; as we know it<\/h4>\n<p>How do you define Intelligence and what do you mean by when you say somebody is more intelligent than others. We have to go back in time when during 1930s intelligence was defined by what intelligence test measure. There were also many types of intelligence defined and that was too much. It is also strange to measure the intelligence by tests.<\/p>\n<p>Actually, it&#8217;s quite deep, because a person&#8217;s view of intelligence decides how intelligence tests are developed. Intelligence tests focus on verbal, spatial, number reasoning because that&#8217;s what was the predominant view of what intelligent people demonstrate.<\/p>\n<h4>Intelligence &#8211; the reasonable explanation<\/h4>\n<p>People denotes intelligence in terms of ability &#8211; low ability, high ability, no ability, it is mostly found in schools. It is worrisome the way the world &#8216;ability&#8217; is being used &#8211; It is not used in the sense that kids haven&#8217;t developed the ability but they haven&#8217;t got it when born. They are born with a lot of or not much ability that causes learning. It should be actually the ability to develop the ability, so it should be a measure of learning, not the cause of learning.<\/p>\n<p>Are we born with the same ability that we develop more as we go through schooling?  The answer is we&#8217;re born with certain capacities, how they develop really depends on the environment, the stimulation. We all have a capacity for language, but the language we speak and to what extent depends on our culture and society. If we live in the jungle we don&#8217;t develop the language capability.<\/p>\n<h4>Environment and its importance<\/h4>\n<p>There may be ranges of capacities, but the key thing is the way they interact with the environment. So if you have a really deprived environment it&#8217;s going to be very difficult to come out with high ability because you&#8217;ve not had the stimulation, you&#8217;ve not had the structures and support.  That&#8217;s why, often, we see such big and clearly visible differences between kids who come from very poor backgrounds and kids from privileged backgrounds.<\/p>\n<p>Along with language, this holds true for reading, privileged kids would have more exposure to books, exposure to stories and lessons. As a result, the ability to use reading to learn is developed more rather than just struggling to learn to read.<\/p>\n<h4>Multiplier to capabilities<\/h4>\n<p>There are small multipliers where we have a small advantage in each but combined they create a bigger impact and advantage. For example, if you are slightly better at kicking a football and you&#8217;re probably slightly older and slightly bigger, so people will say that you are talented and you should go for more coaching or training. With practice, you get better and become part of the state or national team. You get better coaching and very soon people start saying, he&#8217;s a natural or born footballer. Take the story of David Beckham who started kicking the ball when he was three years old. His dad was coaching him that time.<\/p>\n<p>You get better coaching and very soon people start saying, he&#8217;s a natural or born footballer. Take the story of David Beckham who started kicking the ball when he was three years old. His dad was coaching him that time. People used to say that this small kid can hit the ball very far and can bend free kicks. But they didn&#8217;t know that he was practising almost every day. For kids with small advantages,  it accumulates with time more and more. Other kids can&#8217;t make this progress due to the absence of similar stimulation and family background.<\/p>\n<h4>Developing capabilities &#8211; deliberate practice<\/h4>\n<p>Deliberate (intentional) practice is the secret and it is more related to what you are born with and raised with &#8211; resilience and being able to push yourself, keep going in tough situations. We are not born with these hard-wired skills &#8211; are you born tennis player &#8211; do you learn tennis in the womb and start playing when coming out. It is also true for musicians, artists, CEOs, etc. Deliberate practice is to do with opportunities we get and resilient dedication to practice to make the learning ability strong and automatic.<\/p>\n<p>Malcolm Gladwell and his outlier study say nobody gets to the top of anything without putting 10,000 hours (for 3 years &#8211; 3hrs daily) of deliberate practice, it seems true for musicians, sportspersons, etc. Deliberate practice is where you are fighting for things that you are not good at and eventually get better and better.<\/p>\n<p>To improve is quite difficult, mentally challenging and tiring if you&#8217;re doing it properly otherwise you are just enjoying things when they work out and abandon them when they don&#8217;t work.<\/p>\n<h4>Deliberate practice &#8211; how it works<\/h4>\n<p>Achievers have got more flexible and stronger mental framework to make sense of stuff, they see the bigger picture quicker and better than a novice. They can make sense of the new stuff they see and interact with it quickly rather than getting confused.<\/p>\n<p>How you can use this practice &#8211; first thing is to have opportunities and choices. Why don&#8217;t some kids learn or not interested in learning? Most schools never link to the stuff kids really interested in (can we find out what kids are interested in?).<\/p>\n<p>Do we give them choices they&#8217;re interested in? No, almost all the schools are focussing on cramming and pushing kids through a curriculum with exams. Everybody is good at something. It&#8217;s just that we don&#8217;t find out it more often. There are many kids who learned nothing in school but can tell you everything you wanted to know about the planets, cycles, sports they like, etc. There are many kids who couldn&#8217;t remember poems could recite the lyrics of their fav songs. There is a clear mismatch between kids and schools\/society, we couldn&#8217;t make the links with them.<\/p>\n<p>Take another example, this time of Bill Gates, his computing skills developed because the school had a computing room with a mainframe terminal. This setup was very rare in the universities but he got it in school. He could do programming and the school just let him do it. By the age of 15, he was doing payroll programming for quite large companies with his mate and he was approached by a very big utility company when he was ~18. School supported him for this project for taking credit of the cooperation. He went for three months to put Westinghouse&#8217;s payroll together and things like this and ideas of cashing in kept on developing and becoming stronger with time. This happened because he got the choices, opportunities, and support.<\/p>\n<p>Nurture the kids like they are free birds with different opportunities around &#8211; let them pick some and you support them in encouragement and teachings. Trust them and listen them more than you talk.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Intelligence &#8211; as we know it How do you define Intelligence and what do you mean by when you say somebody is more intelligent than others. We have to go back in time when during 1930s intelligence was defined by what intelligence test measure. There were also many types of intelligence defined and that was too much. It&hellip; <a class=\"more-link\" href=\"http:\/\/localhost:8180\/2017\/07\/03\/know-and-spread-intelligence\/\">Continue reading <span class=\"screen-reader-text\">Know and spread intelligence<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2,232],"tags":[240,200,239],"_links":{"self":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/704"}],"collection":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/comments?post=704"}],"version-history":[{"count":13,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/704\/revisions"}],"predecessor-version":[{"id":744,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/704\/revisions\/744"}],"wp:attachment":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/media?parent=704"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/categories?post=704"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/tags?post=704"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}