{"id":711,"date":"2017-08-21T02:16:01","date_gmt":"2017-08-20T20:46:01","guid":{"rendered":"https:\/\/www.sciloo.com\/?p=711"},"modified":"2017-08-22T10:24:51","modified_gmt":"2017-08-22T04:54:51","slug":"art-of-teaching","status":"publish","type":"post","link":"http:\/\/localhost:8180\/2017\/08\/21\/art-of-teaching\/","title":{"rendered":"art of teaching"},"content":{"rendered":"<div class=\"paragraph\">\n<p>A teacher needs to recognize that they&#8217;re not working alone, It&#8217;s very easy for teachers to become isolated within their classrooms and also with their problems.<\/p>\n<p>A few years back, teachers used to feel happy to go to seniors (head\/principal) and talk openly about the problems they were facing, but now it is very difficult to think and do. Now, we live in a situation in schools in which people and the idea of collaboration are slowly disappearing.<\/p>\n<p>Teaching is about learning and developing certain skills, certain competencies and keeping certain strategies at your disposal. Without empathy and considerations about social economic backgrounds of students, these competencies become very unhelpful for teachers and it produces a very limited idea of what teaching is.<\/p>\n<p>But without questions, there are going to be no answers. And so the importance of asking questions is being recognized and a lot more now. We always remember a teacher who has touched us in some way. For a good teacher, children think he is one of them and one of us too. Teaching isn&#8217;t just about certain skills, competencies, strategies, etc., there&#8217;s something else that is also required.<\/p>\n<h4>Reflective Practice<\/h4>\n<p>Reflection practice challenges assumptions that we bring with us into teaching and it questions us how we should do things differently in a better way. It reinforces our belief in what we do. Challenging our assumption is very difficult thing to do because we don&#8217;t know what our assumptions are and that&#8217;s the reason they&#8217;re called assumptions.<\/p>\n<p>During our lifetime we develop certain mental frameworks &#8211; ways of understanding the world, experiencing the world. new experiences, new information. Instead of changing the way we look at the world, we try to manipulate this new experience to challenge it. We try to manipulate it in such a way that we can fit it into our existing understandings. You know, I think we all understand how, how we do this. and, you know, these are our assumptions.<\/p>\n<p>If we don&#8217;t challenge our assumptions, we would always just stay the way that we are and nothing grows with us.<\/p>\n<h4>Reflexive teaching<\/h4>\n<p>Reflexivity encourages us to understand our practice in relation to the society\/the world in which we live. We should understand how our students socioeconomic and cultural backgrounds have an impact on how they experience schooling.  It is not about thinking just ourselves in isolation, about our personal qualities, our competencies, it&#8217;s about developing an understanding of the impact of students lives outside of school, on the way they are and the way they learn inside the school. It would include, for example, understanding the impact of emotions on students.<\/p>\n<p>Understanding behavior more in terms of what happens outside of school and developing appropriate ways of dealing with not just dismissing someone&#8217;s behavior as bad, or unacceptable. We may feel we need to punish bad behavior but teaching is about trying to understand it in terms of a student&#8217;s wider life. We cannot just treat our emotions as things that we can just dump any place conveniently. We carry them with us all the time, we are humans.<\/p>\n<p>The most important thing we&#8217;re encouraged to leave out the classroom or interaction our feelings &#8211; Teachers are not supposed to have feelings. This is wrong. We need to support our kids emotionally by understanding why they are behaving in a particular manner by asking questions so that they can explain.<\/p>\n<p>We need to be an ear to them who don&#8217;t ignore them and listen to them with embrace and compassion.<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>A teacher needs to recognize that they&#8217;re not working alone, It&#8217;s very easy for teachers to become isolated within their classrooms and also with their problems. A few years back, teachers used to feel happy to go to seniors (head\/principal) and talk openly about the problems they were facing, but now it is very difficult to think and do. Now,&hellip; <a class=\"more-link\" href=\"http:\/\/localhost:8180\/2017\/08\/21\/art-of-teaching\/\">Continue reading <span class=\"screen-reader-text\">art of teaching<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2,193],"tags":[6,241],"_links":{"self":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/711"}],"collection":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/comments?post=711"}],"version-history":[{"count":13,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/711\/revisions"}],"predecessor-version":[{"id":797,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/711\/revisions\/797"}],"wp:attachment":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/media?parent=711"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/categories?post=711"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/tags?post=711"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}