{"id":764,"date":"2017-09-04T01:44:00","date_gmt":"2017-09-03T20:14:00","guid":{"rendered":"https:\/\/www.sciloo.com\/?p=764"},"modified":"2017-09-18T00:12:59","modified_gmt":"2017-09-17T18:42:59","slug":"value-customer-stakeholders","status":"publish","type":"post","link":"http:\/\/localhost:8180\/2017\/09\/04\/value-customer-stakeholders\/","title":{"rendered":"Value for Customer and Stakeholders"},"content":{"rendered":"<p>We need to focus on the following two dimensions to ensure that our innovation has a future.<\/p>\n<ol>\n<li>Isolated or Systematic innovation<\/li>\n<li>Creation or Substitution innovation<\/li>\n<\/ol>\n<h4>Isolated or Systematic innovation<\/h4>\n<p>Innovation that works alone such as simple hand tools like Moka pot or pen. For the pen to make work you need a sheet of paper and that&#8217;s it. If the product is bit complex and is a part of production system such as design, development, verification in a process and reviewed regularly to maintain the quality, it is called systematic innovation. An example can be motor where different parts are acquired from different producers and assembled with the quality checks and other processes.<\/p>\n<h4>Creation or Substitution innovation<\/h4>\n<p>Your innovation can create a new market which is a difficult and rare phenomenon. Take an example of Google, which created a new market &#8211; search engine advertising and data analytics on the mass scale real behavioral data. What is the challenge, nobody knows it and we don&#8217;t know if there is a such market that exists or not. It is based on a latent need that we feel to be real but we are not sure.<\/p>\n<p>On the opposite side, there is the substitution innovation representing the majority of the innovations. We compare the innovation features to the existing ones to judge which one is better. So it is kind of a reference system and the product\/service will be placed for comparison. There are also obstacles to substitution &#8211; we need to check the consumers of our product whether they easily accept innovation or oppose it.<\/p>\n<h4>Value created by my innovation<\/h4>\n<p>It is the value perceived by the consumer. So, what is the value perceived by the consumer? It can be a trade-off &#8211; a compromise between the benefits that the consumer will perceive and the sacrifices linked to the innovation.<\/p>\n<p>In some cases, it can be easy where customer understand the value because he can see the effects immediately but in some other cases, the perceived value will be way below reality. It is often the case for technological innovators &#8211; we speak of performance level, of technical challenges, whereas what interests the customer are the immediate benefits &#8211; the answer to his needs.<\/p>\n<h4>Benefits for the customers<\/h4>\n<ol>\n<li>Money &#8211; You can save money with the innovation.<\/li>\n<li>Time &#8211; I will save you time as mostly seen in software products.<\/li>\n<li>Pain &#8211; It solves a problem that was not solved till now or was very difficult to do.<\/li>\n<\/ol>\n<p>These are the three main benefits, the more we manage to combine, the better will be the value. The better will be the perceived value of our innovations. Show the facts and talk numbers rather talking in  the abstract terms about these 3 benefits and customers will appreciate the whole idea.<\/p>\n<h4>Sacrifices for the customers<\/h4>\n<ol>\n<li>Transfer Costs<\/li>\n<li>Risks<\/li>\n<li>Unsustainability &#8211; such as a new startup can go out of business and responsibility anytime as they have not stayed in the market for a long time.<\/li>\n<\/ol>\n<p>We often overestimate the benefits and underestimate the sacrifices linked to the innovation.<\/p>\n<h4>Be careful with self-centered analysis and try to have the views and opinions of the following actors<\/h4>\n<ol>\n<li>Consumers<\/li>\n<li>Future Consumers<\/li>\n<\/ol>\n<p>The value perceived by the consumer in not uniform in all the markets. It is our responsibility to improve this value gradually by improving our product\/service features and offerings. Start with the main targets first mainly verticals and then open the market progressively to other targets.<\/p>\n<p>This value is not felt just by the end user (consumer) but often there is a range of consumers. If we use a supplier, the supplier will also need to find a value for himself, and it goes to the last consumer. Sometimes, the user finds a high value but the buyer doesn&#8217;t &#8211; solve it by creating value for each step of this consumer chain, for each stakeholder.<\/p>\n<p>It can be different according to the different stakeholders but it must always exist and be taken care. Startups need to be aware of these dimensions early on.<\/p>\n<p>Please share if you have any interesting story or experience for value creation and problem faced.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We need to focus on the following two dimensions to ensure that our innovation has a future. Isolated or Systematic innovation Creation or Substitution innovation Isolated or Systematic innovation Innovation that works alone such as simple hand tools like Moka pot or pen. For the pen to make work you need a sheet of paper&hellip; <a class=\"more-link\" href=\"http:\/\/localhost:8180\/2017\/09\/04\/value-customer-stakeholders\/\">Continue reading <span class=\"screen-reader-text\">Value for Customer and Stakeholders<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[132],"tags":[248,237,135,247],"_links":{"self":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/764"}],"collection":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/comments?post=764"}],"version-history":[{"count":13,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/764\/revisions"}],"predecessor-version":[{"id":823,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/764\/revisions\/823"}],"wp:attachment":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/media?parent=764"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/categories?post=764"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/tags?post=764"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}