{"id":709,"date":"2017-06-27T10:27:17","date_gmt":"2017-06-27T04:57:17","guid":{"rendered":"https:\/\/www.sciloo.com\/?p=709"},"modified":"2017-06-27T11:06:19","modified_gmt":"2017-06-27T05:36:19","slug":"parenting-for-better-learnings","status":"publish","type":"post","link":"http:\/\/localhost:8180\/2017\/06\/27\/parenting-for-better-learnings\/","title":{"rendered":"Parenting for better learnings"},"content":{"rendered":"<h4>Build on &#8211; expose the world to them<\/h4>\n<p>Find out what your child actually knows and understands, rather than assuming. Asking them good questions would expose many misconceptions and misunderstandings about the world to them. Imagine with little older kids, if we&#8217;re talking about the earth rotation, its orbit, our solar system, they can tell us what is earth and other planets. But can they tell what causes an eclipse? Make better questioning part of life by asking open-ended questions that give us evidence about what and how does this kid understand or not understand.<\/p>\n<h4>Make base strong &#8211; don&#8217;t feed them<\/h4>\n<p>They might tell that the sun is moving around the earth and not the other way which is wrong but hold on. Also ask, why is it night in India when it&#8217;s day in the USA. You&#8217;ll expose them to some very basic scientific fundamentals that you can build on. Kids can come up with totally weird answers and we tend to correct them with the right answers. Rather we should ask them where did they get the answer from, how did they think about it? If you keep feeding them right answers you might never know what is wrong in their thinking process and how they arrive at a particular answer.<\/p>\n<h4>Big picture and Feedback<\/h4>\n<p>As parents, we should show them the bigger picture to make them understand what&#8217;s going on here. It is a very critical piece in their life and growth as they might not connect with the bigger picture when they are doing something. It can affect their interest and motivation.<\/p>\n<p>Another very important area where the parents must be involved all the time is feedback. What kind of feedback do you give? Most of the time it empty and useless feedback. Feedback should be very specific and task focussed and should produce a set of corrective actions.<\/p>\n<p>See the sports coaches, they diagnose whatever the particular sportsperson is doing well and not doing well and then focuses in on the things they need to improve. The importance of the big picture and growth in a skill are very critical aspects of feedback.<\/p>\n<p>Help kids in know what are they doing, why are they doing and how they can make sense of it. It&#8217;s kind of chess board game, If you know the rules of the game, if you can spot the patterns, you&#8217;ve got a much more powerful memory than if all you&#8217;re trying to remember a few pieces and games that you already played.<\/p>\n<h4>Imagination<\/h4>\n<p>Help them imagine what will it be like if they are successful (doing something they love and want to do)? Many successful people imagine themselves doing things and dreaming about achieving the goals and the life they want to have, coach the kids with this principle &#8211; imagining, believing, working and achieving.<\/p>\n<h4>Ability or disability induction<\/h4>\n<p>Don&#8217;t focus on the word or rather forget the word &#8211; ability, rather work with kind of apprenticeship model, where you talk about somebody being naive, novice, apprentice, expert, master as they learn, do, and progress.<\/p>\n<p>Life is a learning process, it is about the work itself not about the kid. Ability is all about reputations, labels, and that really interferes with how teachers and schools treat kids. The biggest difference between a good teacher and a normal teacher is the level of the cognitive demand of the work they set their kids, all the kids.<\/p>\n<p>Expert\/good teachers expect more from all of their kids, not just the bright ones. They expect them to do deep learning work which is understanding themselves, making sense of it for themselves. So stay away from the word ability and demand more of our children, all the children.<\/p>\n<p>If you’re told that you are high ability or low ability, It doesn’t take you far for certainly. But If you are told that you can do something well or you can do something better, it gives you a lot of possibilities and opportunities.<\/p>\n<p>By putting kids into ability groups is very harmful, kids at the top get the more imaginative, better, more creative and kids at the bottom are treated as they&#8217;re not going to do well. Kids at the bottom are event told that you are less capable and not in the same league. The gap widens with time and distorts the thinking process and confidence of kids. It is like we are writing a script for them at that point about what they can and can&#8217;t do without really testing it out, without really giving them opportunities, without understanding them.<\/p>\n<p>Kids (ours and others) are like flowers and nature, each has its own beauty and variations, we should nurture it rather than segregating them and damaging them to the core.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Build on &#8211; expose the world to them Find out what your child actually knows and understands, rather than assuming. Asking them good questions would expose many misconceptions and misunderstandings about the world to them. Imagine with little older kids, if we&#8217;re talking about the earth rotation, its orbit, our solar system, they can tell us what is earth and&hellip; <a class=\"more-link\" href=\"http:\/\/localhost:8180\/2017\/06\/27\/parenting-for-better-learnings\/\">Continue reading <span class=\"screen-reader-text\">Parenting for better learnings<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2,193,192,232],"tags":[219,57,200],"_links":{"self":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/709"}],"collection":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/comments?post=709"}],"version-history":[{"count":8,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/709\/revisions"}],"predecessor-version":[{"id":732,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/posts\/709\/revisions\/732"}],"wp:attachment":[{"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/media?parent=709"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/categories?post=709"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost:8180\/wp-json\/wp\/v2\/tags?post=709"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}